/*
 * ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 *                       [플레이 흐름]
 * 1. 게임 시작 여부 확인
 *    1-1. Y:게임판 초기화 진행 및 시작
 *    1-2. N: 게임 종료 
 * 2. 게임 종료 규칙 확인
 *    2-1. 플레이 가능
 *        - 블록 랜덤 생성 > 게임판 업데이트
 *        - 블록 움직임 입력값 여부
 *          - 있으면: 블록 위치 업데이트 > 게임판 업데이트
 *        - 업데이트된 블록판 출력
 *    2-2. 플레이 불가능
 *        - 최종 보드판 출력
 * ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 *                         [규칙]
 * 1. 게임 기본 규칙
 *    1-1. 블록은 상단에서 하단으로 0.8초 기준으로 자동 하강
 *    1-2. 하강 도중 블록 위치 업데이트가 가능
 *    1-3. 가로 한 줄이 모두 블록으로 이루어질 경우, 
 *         해당 줄은 제거되며 그 윗에 배치되어있는 블록들 하강
 *    1-4. 블록이 배치될 수 있는 가장 하단에 닿을 경우,
 *         블록 움직임 종료
 *         *블록 움직임 종료 시, 기존 블록과 다르게 색상 변경
 * 2. 게임 종료 규칙
 *    2-1. 상단 '규정선'을 넘을 경우
 *    2-2. 사용자가 q 입력
 * ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 *                       [파일 설명]
 *  main.c: 게임 종료 여부 관리.
 *  play.c: 게임 상태를 업데이트하는 로직.
 * input.c: 사용자 입력에 따른 블록의 이동, 회전 등을 관리.
 * board.c: 게임판 상태를 유지하고, 블록의 위치와 충돌 검사.
 * block.c: 블록의 종류와 모양을 정의하고, 블록의 회전 및 이동 로직.
 * ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
 */

#include "play.h"
#include "board.h"
#include "block.h"
#include "input.h"

int main() {
    
    clearScreen();
    startGame();       // 게임 시작 여부

    return 0;
}